---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.GenericRepoHelperService
source: html/fb9286fd-8d3b-04a9-8bcc-1867a917bcf5.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.GenericRepoHelperService Property

Unique service id.

## Syntax (C#)
```csharp
public static ExternalServiceId GenericRepoHelperService { get; }
```